Model: "functional_11"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_5 (InputLayer)            [(None, 22284)]      0                                            
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 100)          2228500     input_5[0][0]                    
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 100)          2228500     input_5[0][0]                    
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 100)          400         dense_9[0][0]                    
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 100)          400         dense_10[0][0]                   
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 100)          0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 100)          0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
lambda_3 (Lambda)               (None, 100)          0           activation_6[0][0]               
                                                                 activation_7[0][0]               
__________________________________________________________________________________________________
dense_11 (Dense)                (None, 22284)        2250684     lambda_3[0][0]                   
__________________________________________________________________________________________________
custom_variational_layer_3 (Cus (None, 22284)        0           input_5[0][0]                    
                                                                 dense_11[0][0]                   
==================================================================================================
Total params: 6,708,484
Trainable params: 6,708,084
Non-trainable params: 400