Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 1669)]       0                                            
__________________________________________________________________________________________________
dense (Dense)                   (None, 28)           46760       input_1[0][0]                    
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 28)           46760       input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 28)           112         dense[0][0]                      
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 28)           112         dense_1[0][0]                    
__________________________________________________________________________________________________
activation (Activation)         (None, 28)           0           batch_normalization[0][0]        
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 28)           0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
lambda (Lambda)                 (None, 28)           0           activation[0][0]                 
                                                                 activation_1[0][0]               
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 1669)         48401       lambda[0][0]                     
__________________________________________________________________________________________________
custom_variational_layer (Custo (None, 1669)         0           input_1[0][0]                    
                                                                 dense_2[0][0]                    
==================================================================================================
Total params: 142,145
Trainable params: 142,033
Non-trainable params: 112
__________________________________________________________________________________________________

