Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 33298)]      0                                            
__________________________________________________________________________________________________
dense (Dense)                   (None, 100)          3329900     input_1[0][0]                    
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 100)          3329900     input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 100)          400         dense[0][0]                      
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 100)          400         dense_1[0][0]                    
__________________________________________________________________________________________________
activation (Activation)         (None, 100)          0           batch_normalization[0][0]        
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 100)          0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
lambda (Lambda)                 (None, 100)          0           activation[0][0]                 
                                                                 activation_1[0][0]               
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 33298)        3363098     lambda[0][0]                     
__________________________________________________________________________________________________
custom_variational_layer (Custo (None, 33298)        0           input_1[0][0]                    
                                                                 dense_2[0][0]                    
==================================================================================================
Total params: 10,023,698
Trainable params: 10,023,298
Non-trainable params: 400
__________________________________________________________________________________________________