Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 1669)]       0                                            
__________________________________________________________________________________________________
dense (Dense)                   (None, 100)          167000      input_1[0][0]                    
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 100)          167000      input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 100)          400         dense[0][0]                      
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 100)          400         dense_1[0][0]                    
__________________________________________________________________________________________________
activation (Activation)         (None, 100)          0           batch_normalization[0][0]        
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 100)          0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
lambda (Lambda)                 (None, 100)          0           activation[0][0]                 
                                                                 activation_1[0][0]               
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 1669)         168569      lambda[0][0]                     
__________________________________________________________________________________________________
custom_variational_layer (Custo (None, 1669)         0           input_1[0][0]                    
                                                                 dense_2[0][0]                    
==================================================================================================
Total params: 503,369
Trainable params: 502,969
Non-trainable params: 400
__________________________________________________________________________________________________

Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 1668)]       0                                            
__________________________________________________________________________________________________
dense (Dense)                   (None, 100)          166900      input_1[0][0]                    
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 100)          166900      input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 100)          400         dense[0][0]                      
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 100)          400         dense_1[0][0]                    
__________________________________________________________________________________________________
activation (Activation)         (None, 100)          0           batch_normalization[0][0]        
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 100)          0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
lambda (Lambda)                 (None, 100)          0           activation[0][0]                 
                                                                 activation_1[0][0]               
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 1668)         168468      lambda[0][0]                     
__________________________________________________________________________________________________
custom_variational_layer (Custo (None, 1668)         0           input_1[0][0]                    
                                                                 dense_2[0][0]                    
==================================================================================================
Total params: 503,068
Trainable params: 502,668
Non-trainable params: 400
__________________________________________________________________________________________________

