Model: "functional_17"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_7 (InputLayer)            [(None, 22284)]      0                                            
__________________________________________________________________________________________________
dense_12 (Dense)                (None, 100)          2228500     input_7[0][0]                    
__________________________________________________________________________________________________
dense_13 (Dense)                (None, 100)          2228500     input_7[0][0]                    
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 100)          400         dense_12[0][0]                   
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 100)          400         dense_13[0][0]                   
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 100)          0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 100)          0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
lambda_4 (Lambda)               (None, 100)          0           activation_8[0][0]               
                                                                 activation_9[0][0]               
__________________________________________________________________________________________________
dense_14 (Dense)                (None, 22284)        2250684     lambda_4[0][0]                   
__________________________________________________________________________________________________
custom_variational_layer_4 (Cus (None, 22284)        0           input_7[0][0]                    
                                                                 dense_14[0][0]                   
==================================================================================================
Total params: 6,708,484
Trainable params: 6,708,084
Non-trainable params: 400