Model: "functional_23"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_9 (InputLayer)            [(None, 54676)]      0                                            
__________________________________________________________________________________________________
dense_15 (Dense)                (None, 100)          5467700     input_9[0][0]                    
__________________________________________________________________________________________________
dense_16 (Dense)                (None, 100)          5467700     input_9[0][0]                    
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 100)          400         dense_15[0][0]                   
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 100)          400         dense_16[0][0]                   
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 100)          0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 100)          0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
lambda_5 (Lambda)               (None, 100)          0           activation_10[0][0]              
                                                                 activation_11[0][0]              
__________________________________________________________________________________________________
dense_17 (Dense)                (None, 54676)        5522276     lambda_5[0][0]                   
__________________________________________________________________________________________________
custom_variational_layer_5 (Cus (None, 54676)        0           input_9[0][0]                    
                                                                 dense_17[0][0]                   
==================================================================================================
Total params: 16,458,476
Trainable params: 16,458,076
Non-trainable params: 400