Model: "functional_9"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_4 (InputLayer)            [(None, 22646)]      0                                            
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 100)          2264700     input_4[0][0]                    
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 100)          2264700     input_4[0][0]                    
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 100)          400         dense_6[0][0]                    
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 100)          400         dense_7[0][0]                    
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 100)          0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 100)          0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 100)          0           activation_4[0][0]               
                                                                 activation_5[0][0]               
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 22646)        2287246     lambda_2[0][0]                   
__________________________________________________________________________________________________
custom_variational_layer_2 (Cus (None, 22646)        0           input_4[0][0]                    
                                                                 dense_8[0][0]                    
==================================================================================================
Total params: 6,817,446
Trainable params: 6,817,046
Non-trainable params: 400