Model: "functional_29"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_11 (InputLayer)           [(None, 54676)]      0                                            
__________________________________________________________________________________________________
dense_18 (Dense)                (None, 100)          5467700     input_11[0][0]                   
__________________________________________________________________________________________________
dense_19 (Dense)                (None, 100)          5467700     input_11[0][0]                   
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 100)          400         dense_18[0][0]                   
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 100)          400         dense_19[0][0]                   
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 100)          0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 100)          0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
lambda_6 (Lambda)               (None, 100)          0           activation_12[0][0]              
                                                                 activation_13[0][0]              
__________________________________________________________________________________________________
dense_20 (Dense)                (None, 54676)        5522276     lambda_6[0][0]                   
__________________________________________________________________________________________________
custom_variational_layer_6 (Cus (None, 54676)        0           input_11[0][0]                   
                                                                 dense_20[0][0]                   
==================================================================================================
Total params: 16,458,476
Trainable params: 16,458,076
Non-trainable params: 400